#!../bin/rails runner 
#
#run this script with:
#bin/rails runner path/to/filename.rb
#
#
#
def create_abbr( string )
  return string if string.length<8
  a = string.split
  abbr = ""
  a.each do |s|
    abbr += s[0..3]
  end
  return abbr[0..7] if abbr.length>8
  return string[0..7] if abbr.length<8
  abbr
end

lessons = [
  ["ΑΕ", "Αγωγή Υγείας", 2, "Θ","13407 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1427"],
  ["ΑΕ", "Αρχές Γραμμικού και Αρχιτεκτονικού Σχεδίου", 2, "Θ","13407 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1427"],
  ["ΑΕ", "Αρχές Ηλεκτρολογίας και Ηλεκτρονικής", 2, "Θ","13407 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1427"],
  ["ΑΕ", "Αρχές Μηχανολογίας", 2, "Θ","13407 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1427"],
  ["ΑΕ", "Αρχές Οικονομίας", 2, "Θ","13407 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1427"],
  ["ΑΕ", "Βασικές Αρχές Σύνθεσης", 2, "Θ","13407 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1427"],
  ["ΑΕ", "Γεωπονία και Αειφόρος Ανάπτυξη", 2, "Θ","13407 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1427"],
  ["ΑΕ", "Ναυτική Τέχνη", 2, "Θ","13407 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1427"],
  ["ΒΗ", "Ηλεκτροτεχνία (Κυκλώματα Συνεχούς και Εναλλασσόμενου Ρεύματος)", 2, "Θ","13407 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1427"],
  ["ΒΗ", "Ηλεκτροτεχνία (Κυκλώματα Συνεχούς και Εναλλασσόμενου Ρεύματος)", 2, "Ε","13407 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1427"],
  ["ΒΗ", "Εσωτερικές Ηλεκτρικές Εγκαταστάσεις και Ηλεκτρολογικό Σχέδιο", 2, "Θ","13407 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1427"],
  ["ΒΗ", "Εσωτερικές Ηλεκτρικές Εγκαταστάσεις και Ηλεκτρολογικό Σχέδιο", 5, "Ε","13407 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1427"],
  ["ΒΗ", "Εισαγωγή στα Υπολογιστικά Συστήματα και στα Δίκτυα Επικοινωνιών", 3, "Ε","13407 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1427"],
  ["ΒΗ", "Αυτοματισμοί-Αισθητήρες", 2, "Ε","13407 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1427"],
  ["ΒΗ", "Αναλογικά και Ψηφιακά Ηλεκτρονικά", 2, "Θ","13407 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1427"],
  ["ΒΗ", "Αναλογικά και Ψηφιακά Ηλεκτρονικά", 4, "Ε","13407 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1427"],
  ["ΒΗ", "Αγγλικά Τομέα", 1, "Θ","13407 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1427"],
  ["Α", "Νέα Ελληνικά", 4, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["Α", "Άλγεβρα", 3, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["Α", "Γεωμετρία", 1, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["Α", "Φυσική", 2, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["Α", "Χημεία", 1, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["Α", "Βιολογία", 1, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["Α", "Πολιτική Παιδεία", 2, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["Α", "Ιστορία", 1, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["Α", "Θρησκευτικά", 1, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["Α", "Αγγλικά", 2, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["Α", "Φυσική Αγωγή", 2, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["Α", "Πληροφορική", 2, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["Α", "Ερευνητική Εργασία στην Τεχνολογία", 2, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["Α", "Σχολικός Επαγγελματικός Προσανατολισμός", 2, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["Α", "Ζώνη Δημιουργικών Δραστηριοτήτων", 3, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["Β", "Νέα Ελληνικά", 3, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["Β", "Άλγεβρα", 2, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["Β", "Γεωμετρία", 1, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["Β", "Φυσική", 1, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["Β", "Χημεία", 1, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["Β", "Θρησκευτικά", 1, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["Β", "Αγγλικά", 1, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["Β", "Φυσική Αγωγή", 1, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["Β", "Εισαγωγή στις Αρχές της Επιστήμης των Η/Υ", 1, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΓ", "Αρχές Αγροτικής Ανάπτυξης", 2, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΓ", "Περιβάλλον και Γεωργία", 1, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΓ", "Περιβάλλον και Γεωργία", 2, "Ε","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΓ", "Φυτική Παραγωγή", 2, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΓ", "Φυτική Παραγωγή", 2, "Ε","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΓ", "Ζωική Παραγωγή", 2, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΓ", "Ζωική Παραγωγή", 2, "Ε","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΓ", "Τεχνολογία Τροφίμων", 2, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΓ", "Τεχνολογία Τροφίμων", 2, "Ε","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΓ", "Αρχές Αρχιτεκτονικής Τοπίου", 1, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΓ", "Αρχές Αρχιτεκτονικής Τοπίου", 1, "Ε","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΓ", "Στοιχεία Γεωργικών Εγκαταστάσεων και Γεωργικά Μηχανήματα", 2, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΓ", "Στοιχεία Γεωργικών Εγκαταστάσεων και Γεωργικά Μηχανήματα", 1, "Ε","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΓ", "Αγγλικά Τομέα", 1, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΟΙΚ", "Αρχές Λογιστικής", 3, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΟΙΚ", "Αρχές Λογιστικής", 3, "Ε","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΟΙΚ", "Εισαγωγή στο Μάρκετινγκ", 2, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΟΙΚ", "Θεωρία Τουρισμού και Εφαρμογές", 3, "Ε","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΟΙΚ", "Εισαγωγή στην Εφοδιαστική", 2, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΟΙΚ", "Χρηματοπιστωτικές Συναλλαγές-Λογιστικά Φύλλα", 2, "Ε","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΟΙΚ", "Στοιχεία Δικαίου", 4, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΟΙΚ", "Οικονομικά Μαθηματικά και Στατιστική", 2, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΟΙΚ", "Αγγλικά Τομέα", 2, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΜ", "Στοιχεία Τεχνικής Θερμοδυναμικής - Εφαρμογές", 3, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΜ", "Στοιχεία Τεχνικής Θερμοδυναμικής - Εφαρμογές", 3, "Ε","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΜ", "Μηχανική Αντοχή Υλικών", 2, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΜ", "Σχεδιασμός και Περιγραφή Στοιχείων Μηχανών", 3, "Ε","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΜ", "Τεχνολογία Μηχανολογικών Κατασκευών - Εφαρμογές", 2, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΜ", "Τεχνολογία Μηχανολογικών Κατασκευών - Εφαρμογές", 5, "Ε","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΜ", "Βασική Ηλεκτρολογία και Εφαρμογές", 2, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΜ", "Βασική Ηλεκτρολογία και Εφαρμογές", 2, "Ε","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΜ", "Αγγλικά Τομέα", 1, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΠ", "Αρχές Προγραμματισμού Υπολογιστών", 1, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΠ", "Αρχές Προγραμματισμού Υπολογιστών", 3, "Ε","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΠ", "Υλικό και Δίκτυα Υπολογιστών", 2, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΠ", "Υλικό και Δίκτυα Υπολογιστών", 2, "Ε","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΠ", "Βασικά Θέματα Πληροφορικής", 2, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΠ", "Βασικά Θέματα Πληροφορικής", 2, "Ε","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΠ", "Λειτουργικά Συστήματα και Ασφάλεια Πληροφοριακών Συστημάτων", 1, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΠ", "Λειτουργικά Συστήματα και Ασφάλεια Πληροφοριακών Συστημάτων", 2, "Ε","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΠ", "Σχεδιασμός και Ανάπτυξη Ιστοτόπων", 4, "Ε","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΠ", "Τεχνικά Θέματα Πωλήσεων και Προδιαγραφών Υλικού και Λογισμικού", 1, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΠ", "Τεχνικά Θέματα Πωλήσεων και Προδιαγραφών Υλικού και Λογισμικού", 2, "Ε","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΠ", "Αγγλικά Τομέα", 1, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΥ", "Ανατομία - Φυσιολογία", 3, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΥ", "Πρώτες Βοήθειες", 2, "Ε","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΥ", "Υγιεινή", 2, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΥ", "Διαπροσωπικές Σχέσεις", 2, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΥ", "Εργασιακό Περιβάλλον Τομέα", 2, "Ε","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΥ", "Αγγλικά Τομέα", 2, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΥ", "Νοσηλευτική", 1, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΥ", "Νοσηλευτική", 4, "Ε","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΥ", "Μικροβιολογία", 1, "Θ","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["ΒΥ", "Μικροβιολογία", 4, "Ε","18211 2 Ιουνίου 2016 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1567"],
  ["Γ", "Νέα Ελληνικά", 3, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["Γ", "Άλγεβρα", 2, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["Γ", "Γεωμετρία", 1, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["Γ", "Φυσική", 2, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["Γ", "Χημεία", 1, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["Γ", "Αγγλικά", 1, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["Γ", "Φυσική Αγωγή", 1, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["Γ", "Εισαγωγή στις Αρχές της Επιστήμης των Η/Υ", 1, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΦΠ", "Σύγχρονες Γεωργικές Επιχειρήσεις", 3, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΦΠ", "Αρχές Βιολογικής Γεωργίας", 3, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΦΠ", "Δενδροκομία - Αμπελουργία", 2, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΦΠ", "Δενδροκομία - Αμπελουργία", 3, "Ε","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΦΠ", "Φυτά Μεγάλης Καλλιέργειας", 2, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΦΠ", "Φυτά Μεγάλης Καλλιέργειας", 2, "Ε","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΦΠ", "Κηπευτικές Καλλιέργειες - Αρδεύσεις", 2, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΦΠ", "Κηπευτικές Καλλιέργειες - Αρδεύσεις", 3, "Ε","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΦΠ", "Φυτοπροστασία", 2, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΦΠ", "Φυτοπροστασία", 1, "Ε","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΤΤ", "Σύγχρονες Γεωργικές Επιχειρήσεις", 3, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΤΤ", "Αρχές Βιολογικής Γεωργίας", 3, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΤΤ", "Αρχές Επεξεργασίας Τροφίμων", 2, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΤΤ", "Αρχές Επεξεργασίας Τροφίμων", 2, "Ε","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΤΤ", "Μεταποίηση Φυτικών Προϊόντων", 2, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΤΤ", "Μεταποίηση Φυτικών Προϊόντων", 3, "Ε","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΤΤ", "Μεταποίηση Ζωικών Προϊόντων", 2, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΤΤ", "Μεταποίηση Ζωικών Προϊόντων", 3, "Ε","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΤΤ", "Ασφάλεια Τροφίμων", 2, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΤΤ", "Ασφάλεια Τροφίμων", 1, "Ε","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΟΙΚ", "Αρχές Οικονομικής Θεωρίας", 3, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΟΙΚ", "Αρχές Οργάνωσης και Διοίκησης", 3, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΟΙΚ", "Σύγχρονο Περιβάλλον Γραφείου", 2, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΟΙΚ", "Σύγχρονο Περιβάλλον Γραφείου", 2, "Ε","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΟΙΚ", "Φορολογική Πρακτική", 2, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΟΙΚ", "Φορολογική Πρακτική", 4, "Ε","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΟΙΚ", "Λογιστικές Εφαρμογές", 5, "Ε","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΟΙΚ", "Επικοινωνία και Δημόσιες Σχέσεις", 2, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΗΝ", "Ψηφιακά Συστήματα", 3, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΗΝ", "Δίκτυα Υπολογιστών", 3, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΗΝ", "Εφαρμοσμένα Ηλεκτρονικά - Κατασκευές", 2, "Ε","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΗΝ", "Εγκατάσταση και Διαχείριση Δικτύων - Συντήρηση Υπολογιστικών Συστημάτων", 3, "Ε","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΗΝ", "Συστήματα Ελέγχου και Ασφάλειας", 2, "Ε","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΗΝ", "Τηλεπικοινωνίες - Τηλεματική", 3, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΗΝ", "Τηλεπικοινωνίες - Τηλεματική", 2, "Ε","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΗΝ", "Ρομποτική", 3, "Ε","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΗΝ", "Επεξεργασία Σήματος Ήχου και Εικόνας", 2, "Ε","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΜΚ", "Στοιχεία Μηχανών", 3, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΜΚ", "Στοιχεία Σχεδιασμού Κεντρικών Θερμάνσεων", 3, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΜΚ", "Μηχανουργική Τεχνολογία - Εργαλειομηχανές", 2, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΜΚ", "Μηχανουργική Τεχνολογία - Εργαλειομηχανές", 6, "Ε","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΜΚ", "Ανελκυστήρες - Ανυψωτικές Μηχανές ", 2, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΜΚ", "Στοιχεία Ψύξης - Κλιματισμού", 2, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΜΚ", "Στοιχεία Ψύξης - Κλιματισμού", 5, "Ε","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΟΧ", "Στοιχεία Μηχανών", 3, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΟΧ", "Μηχανές Εσωτερικής Καύσης ΙΙ", 3, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΟΧ", "Μηχανές Εσωτερικής Καύσης ΙΙ", 4, "Ε","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΟΧ", "Συστήματα Αυτοκινήτου", 3, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΟΧ", "Συστήματα Αυτοκινήτου", 4, "Ε","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΟΧ", "Τεχνολογία Ελέγχων και Διαγνώσεων", 2, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΟΧ", "Τεχνολογία Ελέγχων και Διαγνώσεων", 4, "Ε","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΠ", "Προγραμματισμός Υπολογιστών", 3, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΠ", "Δίκτυα Υπολογιστών", 3, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΠ", "Προγραμματισμός Υπολογιστών", 2, "Ε","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΠ", "Δίκτυα Υπολογιστών", 2, "Ε","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΠ", "Πληροφοριακά Συστήματα σε Επιχειρήσεις και Οργανισμούς", 2, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΠ", "Συστήματα Διαχείρισης Βάσεων Δεδομένων και Εφαρμογές στο Διαδίκτυο", 4, "Ε","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΠ", "Ειδικά Θέματα στον Προγραμματισμό Υπολογιστών", 4, "Ε","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΠ", "Σχεδιασμός και Ανάπτυξη Διαδικτυακών Εφαρμογών", 3, "Ε","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΥ", "Ανατομία-Φυσιολογία II", 3, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΥ", "Υγιεινή", 2, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΥ", "Νοσηλευτική ΙΙ", 2, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΥ", "Νοσηλευτική ΙΙ", 10, "Ε","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΥ", "Στοιχεία Παθολογίας", 2, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΥ", "Χειρουργική - Τεχνική Χειρουργείου", 2, "Ε","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
  ["ΓΥ", "Στοιχεία Μαιευτικής - Γυναικολογίας", 2, "Θ","13367 26 Απριλίου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 1426"],
]

school_grade_specialties = {}
lessons.each do |lesson|
  if lesson.length != 5
    puts lesson
    raise "Error!"
  end
  p lesson
  school_grade_specialties[ lesson[0] ] ||= 0
  school_grade_specialties[ lesson[0] ] += lesson[2]
  raise "Not found lesson type for #{lesson[1]}" if not LessonType.find_by( code: lesson[3] ) 
end

lessons.each do |lesson|
  puts lesson[0] + "_" + create_abbr(lesson[1])+"_"+lesson[3]
end

school_grade_specialties.each do |k, v|
  puts "#{k} has #{v} hours"
  raise "Not found #{k}" if not SchoolGradeSpecialty.find_by( code: k )
end

puts "Hit enter to continue."
gets

lessons.each do |lesson|
  school_grade_specialty = SchoolGradeSpecialty.find_by( code: lesson[0] )
  lesson_type = LessonType.find_by( code: lesson[3] )
  description = lesson[1]
  abbr = create_abbr description
  abbr = lesson[0] + "_" + abbr +"_" + lesson[3]
  hours = lesson[2]
  Lesson.create( abbr: abbr,
                description: description, 
                hours: lesson[2],
                school_grade_specialty: school_grade_specialty, 
                lesson_type: lesson_type,
                reference: lesson[4] )
end

