 , "29071 9 Αυγούστου 2017 ΤΕΥΧΟΣ ΔΕΥΤΕΡΟ Αρ. Φύλλου 2797"

["Α", "Νέα Ελληνικά", [ΠΕ02], [] , []]
["Α", "Άλγεβρα", [ΠΕ03], [], 
 [ΠΕ04.01, 
   ΠΕ19, ΠΕ20, 
   ΠΕ12.01, ΠΕ12.03, ΠΕ12.04, ΠΕ12.05, ΠΕ12.06, ΠΕ12.07, ΠΕ12.08, ΠΕ12.10, 
   ΠΕ17.01, ΠΕ17.02, ΠΕ17.03, ΠΕ17.04
]]
["Α", "Γεωμετρία", [ΠΕ03], [], 
 [ΠΕ04.01, 
   ΠΕ19, ΠΕ20, 
   ΠΕ12.01, ΠΕ12.03, ΠΕ12.04, ΠΕ12.05, ΠΕ12.06, ΠΕ12.07, ΠΕ12.08, ΠΕ12.10, 
   ΠΕ17.01, ΠΕ17.02, ΠΕ17.03, ΠΕ17.04
]]
["Α", "Φυσική", [ΠΕ04.01, ΠΕ12.10], 
 [ΠΕ04.02, ΠΕ04.03, ΠΕ04.04, ΠΕ04.05, ΠΕ12.08], 
 [ ΠΕ12.01, ΠΕ12.03, ΠΕ12.04, ΠΕ12.05, ΠΕ12.06, ΠΕ12.07]]
["Α", "Χημεία", [ΠΕ04.02, ΠΕ12.08], 
 [ΠΕ04.01, ΠΕ04.03, ΠΕ04.04, ΠΕ04.05, ΠΕ14.01, ΠΕ14.02, ΠΕ14.03, ΠΕ14.04], 
 []]
["Α", "Βιολογία", [ΠΕ04.04, ΠΕ04.03], 
 [ΠΕ04.01, ΠΕ04.02, ΠΕ04.05, 
   ΠΕ14.01, ΠΕ14.02, ΠΕ14.03, ΠΕ14.04, ΠΕ14.06, 
   ΠΕ18.07, ΠΕ18.10, ΠΕ18.11], 
 []]

["Α", "Πολιτική Παιδεία", [ΠΕ09, ΠΕ10, ΠΕ13], [ΠΕ02], []]
["Α", "Ιστορία", [ΠΕ02, ΠΕ33], [ΠΕ05, ΠΕ06, ΠΕ07, ΠΕ10, ΠΕ13], []]
["Α", "Θρησκευτικά", [ΠΕ01]]
["Α", "Αγγλικά", [ΠΕ06]]
["Α", "Φυσική Αγωγή", [ΠΕ11]]
["Α", "Πληροφορική", [ΠΕ19, ΠΕ20]]


["Α", "Ερευνητική Εργασία στην Τεχνολογία", [ΠΕ12.*, ΠΕ14.*, ΠΕ17.*, ΠΕ18.*], [], []]
["Α", "Ζώνη Δημιουργικών Δραστηριοτήτων", [ΠΕ*], [], []]
["Α", "Σχολικός Επαγγελματικός Προσανατολισμός",  [ΠΕ*], [], []]

"ΑΕ", "Αγωγή Υγείας", [
ΠΕ14.01, ΠΕ14.02, ΠΕ14.03, ΠΕ14.06,
ΠΕ18.04, ΠΕ18.07, ΠΕ18.08, ΠΕ18.09, 
ΠΕ18.10, ΠΕ18.11, ΠΕ18.21, ΠΕ18.24, 
ΠΕ18.25, ΠΕ18.33, ΠΕ18.37, ΠΕ18.39
], [], []

"ΑΕ", "Αρχές Γραμμικού και Αρχιτεκτονικού Σχεδίου", [
ΠΕ12.01, ΠΕ12.02, ΠΕ12.03,
ΠΕ17.01, ΠΕ17.05, ΠΕ17.11
], [], []

"ΑΕ", "Αρχές Ηλεκτρολογίας και Ηλεκτρονικής", [
ΠΕ12.05, ΠΕ12.06, ΠΕ12.10,
ΠΕ17.03, ΠΕ17.04, ΠΕ17.07, ΠΕ17.08, ΠΕ17.09
], [], []

"ΑΕ", "Αρχές Μηχανολογίας", [
ΠΕ12.04, ΠΕ12.07
ΠΕ17.02, ΠΕ17.06
ΠΕ18.15, ΠΕ18.18, ΠΕ18.31, ΠΕ18.32
], [], []


"ΑΕ", "Αρχές Οικονομίας", [
ΠΕ09,
ΠΕ18.02, ΠΕ18.03, ΠΕ18.35, ΠΕ18.40
], [ΠΕ10, ΠΕ13], []


"ΑΕ", "Βασικές Αρχές Σύνθεσης", [
ΠΕ08, ΠΕ12.02,
ΠΕ18.01, ΠΕ18.26, ΠΕ18.27, ΠΕ18.28, ΠΕ18.29, ΠΕ18.34
], [ΠΕ18.06,ΠΕ18.20,ΠΕ18.38,ΠΕ18.44], []


"ΑΕ", "Γεωπονία και Αειφόρος Ανάπτυξη", [
ΠΕ14.04, ΠΕ14.05,
ΠΕ18.12, ΠΕ18.13, ΠΕ18.14, ΠΕ18.15, ΠΕ18.16, 
ΠΕ18.17, ΠΕ18.30, ΠΕ18.36
], [], []

"ΑΕ", "Ναυτική Τέχνη", [
ΠΕ18.23, ΠΕ18.31
], [], []


["Β", "Νέα Ελληνικά", [ΠΕ02], [] , []]
["Β", "Άλγεβρα", [ΠΕ03],[],[]]
["Β", "Γεωμετρία", [ΠΕ03],[],[]]
["Β", "Φυσική", [ΠΕ04.01, ΠΕ12.10], 
 [ΠΕ04.02, ΠΕ04.03, ΠΕ04.04, ΠΕ04.05, ΠΕ12.08], 
 []]
["Β", "Χημεία", [ΠΕ04.02, ΠΕ12.08], 
 [ΠΕ04.01, ΠΕ04.03, ΠΕ04.04, ΠΕ04.05, 
   ΠΕ14.01, ΠΕ14.02, ΠΕ14.03, ΠΕ14.04], 
   []]
["Β", "Εισαγωγή στις Αρχές της Επιστήμης των Η/Υ", [ΠΕ19, ΠΕ20]]
["Β", "Θρησκευτικά", [ΠΕ01]]
["Β", "Αγγλικά", [ΠΕ06]]
["Β", "Φυσική Αγωγή", [ΠΕ11]]

["ΒΓ", "Αρχές Αγροτικής Ανάπτυξης" , 
 [ ΠΕ14.04, ΠΕ14.05, ΠΕ18.12,ΠΕ18.13,ΠΕ18.14,ΠΕ18.15,ΠΕ18.16,ΠΕ18.17,ΠΕ18.30,ΠΕ18.36],
 [],[]
]

["ΒΓ", "Περιβάλλον και Γεωργία",
 [ΠΕ14.04, ΠΕ14.05, 
   ΠΕ18.12,ΠΕ18.13,ΠΕ18.14,ΠΕ18.15,ΠΕ18.16,ΠΕ18.17,ΠΕ18.30,ΠΕ18.36, 
   ΤΕ01.32,ΤΕ01.33,ΤΕ01.34,ΤΕ01.36],
 [],[]
]
["ΒΓ", "Φυτική Παραγωγή",
 [ΠΕ14.04, ΠΕ18.12, ΤΕ01.33],
 [ΠΕ14.05, ΠΕ18.13,ΠΕ18.14,ΠΕ18.15,ΠΕ18.16,ΠΕ18.17,ΠΕ18.30,ΠΕ18.36],
 []
]
["ΒΓ", "Ζωική Παραγωγή",
 [ΠΕ14.04, ΠΕ18.13, ΤΕ01.34],
 [ΠΕ14.05, ΠΕ18.12,ΠΕ18.14,ΠΕ18.15,ΠΕ18.16,ΠΕ18.17,ΠΕ18.30,ΠΕ18.36],
 []
]
["ΒΓ", "Τεχνολογία Τροφίμων",
 [ΠΕ14.04, ΠΕ18.36],
 [ΠΕ18.12,ΠΕ18.13,ΠΕ18.14,ΠΕ18.15,ΠΕ18.16,ΠΕ18.17,ΠΕ18.30],
 []
]
["ΒΓ", "Στοιχεία Γεωργικών Εγκαταστάσεων και Γεωργικά Μηχανήματα",
 [ΠΕ14.04, ΠΕ18.15, ΤΕ01.35],
 [ΠΕ14.05, ΠΕ18.12,ΠΕ18.13,ΠΕ18.14,ΠΕ18.16,ΠΕ18.17,ΠΕ18.30,ΠΕ18.36],
 []
]
["ΒΓ", "Αρχές Αρχιτεκτονικής Τοπίου",
 [ΠΕ14.04, ΠΕ14.05, ΠΕ18.16,ΠΕ18.30, ΤΕ01.32],
 [ΠΕ14.05, ΠΕ18.12,ΠΕ18.13,ΠΕ18.14,ΠΕ18.15,ΠΕ18.17,ΠΕ18.36],
 []
]
["ΒΓ", "Αγγλικά Τομέα",
 [ΠΕ06],
 [],
 []
]

["ΒΟΙΚ", "Αρχές Λογιστικής",
 [ΠΕ09,
   ΠΕ18.02, ΠΕ18.03, ΠΕ18.35, ΠΕ18.40,
   ΤΕ01.10, ΤΕ01.11],
   [],
   []
]
["ΒΟΙΚ", "Εισαγωγή στο Μάρκετινγκ",
 [ΠΕ09, ΠΕ18.02, ΠΕ18.03, ΠΕ18.35, ΠΕ18.40, ],
 [],
 []
]
["ΒΟΙΚ", "Θεωρία Τουρισμού και Εφαρμογές",
 [ΠΕ09, ΠΕ18.35],
 [ΠΕ10, ΠΕ13, ΠΕ18.02,ΠΕ18.03,ΠΕ18.40,
   ΤΕ01.10, ΤΕ01.11],
   []
]
["ΒΟΙΚ", "Εισαγωγή στην Εφοδιαστική",
 [ΠΕ09, ΠΕ12.11, ΠΕ18.02, ΠΕ18.03, ΠΕ18.35, ΠΕ18.40, ],
 [],
 []
]
["ΒΟΙΚ", "Χρηματοπιστωτικές Συναλλαγές-Λογιστικά Φύλλα",
 [ΠΕ09, ΠΕ18.02, ΠΕ18.03, ΠΕ18.35, ΠΕ18.40, ΤΕ01.10, ΤΕ01.11],
 [],
 []
]
["ΒΟΙΚ", "Στοιχεία Δικαίου",
[ΠΕ13],
[ΠΕ09, ΠΕ10, ΠΕ18.02, ΠΕ18.03, ΠΕ18.35, ΠΕ18.40,],
[]
]
["ΒΟΙΚ", "Οικονομικά Μαθηματικά και Στατιστική",
 [ΠΕ03, ΠΕ09, ΠΕ18.02, ΠΕ18.03, ΠΕ18.35, ΠΕ18.40, ],
 [],
 []
]
["ΒΟΙΚ", "Αγγλικά Τομέα",
 [ΠΕ06],
 [],
 []
]

["ΒΜ", "Στοιχεία Τεχνικής Θερμοδυναμικής - Εφαρμογές"]
["ΒΜ", "Στοιχεία Τεχνικής Θερμοδυναμικής - Εφαρμογές"]
["ΒΜ", "Μηχανική Αντοχή Υλικών"]
["ΒΜ", "Σχεδιασμός και Περιγραφή Στοιχείων Μηχανών"]
["ΒΜ", "Τεχνολογία Μηχανολογικών Κατασκευών - Εφαρμογές"]
["ΒΜ", "Τεχνολογία Μηχανολογικών Κατασκευών - Εφαρμογές"]
["ΒΜ", "Βασική Ηλεκτρολογία και Εφαρμογές"]
["ΒΜ", "Βασική Ηλεκτρολογία και Εφαρμογές"]
["ΒΜ", "Αγγλικά Τομέα"]
["ΒΠ", "Αρχές Προγραμματισμού Υπολογιστών"]
["ΒΠ", "Αρχές Προγραμματισμού Υπολογιστών"]
["ΒΠ", "Υλικό και Δίκτυα Υπολογιστών"]
["ΒΠ", "Υλικό και Δίκτυα Υπολογιστών"]
["ΒΠ", "Βασικά Θέματα Πληροφορικής"]
["ΒΠ", "Βασικά Θέματα Πληροφορικής"]
["ΒΠ", "Λειτουργικά Συστήματα και Ασφάλεια Πληροφοριακών Συστημάτων"]
["ΒΠ", "Λειτουργικά Συστήματα και Ασφάλεια Πληροφοριακών Συστημάτων"]
["ΒΠ", "Σχεδιασμός και Ανάπτυξη Ιστοτόπων"]
["ΒΠ", "Τεχνικά Θέματα Πωλήσεων και Προδιαγραφών Υλικού και Λογισμικού"]
["ΒΠ", "Τεχνικά Θέματα Πωλήσεων και Προδιαγραφών Υλικού και Λογισμικού"]
["ΒΠ", "Αγγλικά Τομέα"]
["ΒΥ", "Ανατομία - Φυσιολογία"]
["ΒΥ", "Πρώτες Βοήθειες"]
["ΒΥ", "Υγιεινή"]
["ΒΥ", "Διαπροσωπικές Σχέσεις"]
["ΒΥ", "Εργασιακό Περιβάλλον Τομέα"]
["ΒΥ", "Αγγλικά Τομέα"]
["ΒΥ", "Νοσηλευτική"]
["ΒΥ", "Νοσηλευτική"]
["ΒΥ", "Μικροβιολογία"]
["ΒΥ", "Μικροβιολογία"]
["Γ", "Νέα Ελληνικά"]
["Γ", "Άλγεβρα"]
["Γ", "Γεωμετρία"]
["Γ", "Φυσική"]
["Γ", "Χημεία"]
["Γ", "Αγγλικά"]
["Γ", "Φυσική Αγωγή"]
["Γ", "Εισαγωγή στις Αρχές της Επιστήμης των Η/Υ"]
["ΓΦΠ", "Σύγχρονες Γεωργικές Επιχειρήσεις"]
["ΓΦΠ", "Αρχές Βιολογικής Γεωργίας"]
["ΓΦΠ", "Δενδροκομία - Αμπελουργία"]
["ΓΦΠ", "Δενδροκομία - Αμπελουργία"]
["ΓΦΠ", "Φυτά Μεγάλης Καλλιέργειας"]
["ΓΦΠ", "Φυτά Μεγάλης Καλλιέργειας"]
["ΓΦΠ", "Κηπευτικές Καλλιέργειες - Αρδεύσεις"]
["ΓΦΠ", "Κηπευτικές Καλλιέργειες - Αρδεύσεις"]
["ΓΦΠ", "Φυτοπροστασία"]
["ΓΦΠ", "Φυτοπροστασία"]
["ΓΤΤ", "Σύγχρονες Γεωργικές Επιχειρήσεις"]
["ΓΤΤ", "Αρχές Βιολογικής Γεωργίας"]
["ΓΤΤ", "Αρχές Επεξεργασίας Τροφίμων"]
["ΓΤΤ", "Αρχές Επεξεργασίας Τροφίμων"]
["ΓΤΤ", "Μεταποίηση Φυτικών Προϊόντων"]
["ΓΤΤ", "Μεταποίηση Φυτικών Προϊόντων"]
["ΓΤΤ", "Μεταποίηση Ζωικών Προϊόντων"]
["ΓΤΤ", "Μεταποίηση Ζωικών Προϊόντων"]
["ΓΤΤ", "Ασφάλεια Τροφίμων"]
["ΓΤΤ", "Ασφάλεια Τροφίμων"]
["ΓΟΙΚ", "Αρχές Οικονομικής Θεωρίας"]
["ΓΟΙΚ", "Αρχές Οργάνωσης και Διοίκησης"]
["ΓΟΙΚ", "Σύγχρονο Περιβάλλον Γραφείου"]
["ΓΟΙΚ", "Σύγχρονο Περιβάλλον Γραφείου"]
["ΓΟΙΚ", "Φορολογική Πρακτική"]
["ΓΟΙΚ", "Φορολογική Πρακτική"]
["ΓΟΙΚ", "Λογιστικές Εφαρμογές"]
["ΓΟΙΚ", "Επικοινωνία και Δημόσιες Σχέσεις"]
["ΓΗΝ", "Ψηφιακά Συστήματα"]
["ΓΗΝ", "Δίκτυα Υπολογιστών"]
["ΓΗΝ", "Εφαρμοσμένα Ηλεκτρονικά - Κατασκευές"]
["ΓΗΝ", "Εγκατάσταση και Διαχείριση Δικτύων - Συντήρηση Υπολογιστικών Συστημάτων"]
["ΓΗΝ", "Συστήματα Ελέγχου και Ασφάλειας"]
["ΓΗΝ", "Τηλεπικοινωνίες - Τηλεματική"]
["ΓΗΝ", "Τηλεπικοινωνίες - Τηλεματική"]
["ΓΗΝ", "Ρομποτική"]
["ΓΗΝ", "Επεξεργασία Σήματος Ήχου και Εικόνας"]
["ΓΜΚ", "Στοιχεία Μηχανών"]
["ΓΜΚ", "Στοιχεία Σχεδιασμού Κεντρικών Θερμάνσεων"]
["ΓΜΚ", "Μηχανουργική Τεχνολογία - Εργαλειομηχανές"]
["ΓΜΚ", "Μηχανουργική Τεχνολογία - Εργαλειομηχανές"]
["ΓΜΚ", "Ανελκυστήρες - Ανυψωτικές Μηχανές "]
["ΓΜΚ", "Στοιχεία Ψύξης - Κλιματισμού"]
["ΓΜΚ", "Στοιχεία Ψύξης - Κλιματισμού"]
["ΓΟΧ", "Στοιχεία Μηχανών"]
["ΓΟΧ", "Μηχανές Εσωτερικής Καύσης ΙΙ"]
["ΓΟΧ", "Μηχανές Εσωτερικής Καύσης ΙΙ"]
["ΓΟΧ", "Συστήματα Αυτοκινήτου"]
["ΓΟΧ", "Συστήματα Αυτοκινήτου"]
["ΓΟΧ", "Τεχνολογία Ελέγχων και Διαγνώσεων"]
["ΓΟΧ", "Τεχνολογία Ελέγχων και Διαγνώσεων"]
["ΓΠ", "Προγραμματισμός Υπολογιστών"]
["ΓΠ", "Δίκτυα Υπολογιστών"]
["ΓΠ", "Προγραμματισμός Υπολογιστών"]
["ΓΠ", "Δίκτυα Υπολογιστών"]
["ΓΠ", "Πληροφοριακά Συστήματα σε Επιχειρήσεις και Οργανισμούς"]
["ΓΠ", "Συστήματα Διαχείρισης Βάσεων Δεδομένων και Εφαρμογές στο Διαδίκτυο"]
["ΓΠ", "Ειδικά Θέματα στον Προγραμματισμό Υπολογιστών"]
["ΓΠ", "Σχεδιασμός και Ανάπτυξη Διαδικτυακών Εφαρμογών"]
["ΓΥ", "Ανατομία-Φυσιολογία II"]
["ΓΥ", "Υγιεινή"]
["ΓΥ", "Νοσηλευτική ΙΙ"]
["ΓΥ", "Νοσηλευτική ΙΙ"]
["ΓΥ", "Στοιχεία Παθολογίας"]
["ΓΥ", "Χειρουργική - Τεχνική Χειρουργείου"]
["ΓΥ", "Στοιχεία Μαιευτικής - Γυναικολογίας"]
